Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Processing-time semantics can be used for applications with very low latency requirements.
zh_cn: 处理时间语义能够用在具有极低延迟需求的应用中。

source: Processing-time timers fire immediately after the registering method returns.
zh_cn: 处理时间的计时器会在注册方法返回后立即触发，

source: Processing-time windows introduce the lowest latency possi‐
zh_cn: 它能够将延迟降至最低。

source: Processing-time windows introduce the lowest latency possi‐ ble.
zh_cn: 处理时间窗口能够将延迟降至最低。

source: Provided Connectors
zh_cn: 内置连接器

source: Provided Connectors | 187
zh_cn: 内置连接器 | 187

source: Provided Connectors | 191
zh_cn: 内置连接器 | 191

source: Provided Connectors | 193
zh_cn: 内置连接器 | 193

source: Providing exactly-once guarantees requires at-least-once guarantees, and thus a data replay mechanism is again necessary.
zh_cn: 提供精确一次保障是以至少一次保障为前提，因此同样需要数据重放机制。

source: Providing exactly-once guarantees requires at-least-once guarantees, thus a data replay mechanism is again necessary.
zh_cn: 提供精确一次保障是以至少一次保障为前提，因此同样需要数据重放机制。

source: Punctuated assigner: AssignerWithPunctuatedWatermarks is another user- defined function that extracts a timestamp from each record.
zh_cn: 定点分配器（punctuated assigner）：另一个支持从记录中提取时间戳的用户自定义函数叫做AssignerWithPunctuatedWatermarks。

source: Queries can be executed for batch or streaming analysis without modification.
zh_cn: 你无须修改查询就可以将它们用于批或流的分析之中。

source: Queryable State
zh_cn: 可查询式状态

source: Queryable State | 177
zh_cn: 可查询式状态 | 177

source: Queryable State | 181
zh_cn: 可查询式状态 | 181

source: Queryable state does not address all use cases that require an external datastore.
zh_cn: 可查询式状态无法应对全部需要外部数据存储的用例。

source: Queryable state is an easy-to-use feature and can save you the effort of setting up and maintaining a database or key-value store to expose the results of a streaming application to external applications.
zh_cn: 作为一种方便使用的功能，可查询式状态支持将流式应用的结果暴露给外部应用，从而为你节省设置和维护数据库或键值存储的工作量。

source: Querying State from External Applications
zh_cn: 从外部系统查询状态

source: Quite often the logic that needs to be applied on a window can be expressed as an incremental aggregation, but it also needs access to window metadata or state.
zh_cn: 其实很多情况下用于窗口的逻辑都可以表示为增量聚合，只不过还需要访问窗口的元数据或状态。

source: REST command looks like:
zh_cn: 一个典型的curl REST命令就像下面这样：

source: REST request to cancel an application
zh_cn: 取消应用的REST请求

source: REST request to delete a JAR file
zh_cn: 删除JAR文件的REST请求

source: REST request to dispose a savepoint
zh_cn: 删除保存点的REST请求

source: REST request to get basic cluster information
zh_cn: 获取集群基本信息的REST请求

source: REST request to get the JobManager configuration
zh_cn: 获取JobManager配置的REST请求

source: REST request to list all applications
zh_cn: 列出所有应用程序的REST请求

source: REST request to list all connected TaskManagers
zh_cn: 列出所有相连的TaskManager的REST请求

source: REST request to list all uploaded JAR files
zh_cn: 列出所有已上传JAR文件的REST请求

source: REST request to list available JobManager metrics
zh_cn: 列出JobManager可用指标的REST请求

source: REST request to list available TaskManager metrics
zh_cn: 列出TaskManager可用指标的REST请求

source: REST request to rescale an application
zh_cn: 用于应用扩缩容的REST请求

source: REST request to show details of an application
zh_cn: 展示应用详细信息的REST请求

source: REST request to shutdown the cluster
zh_cn: 关闭集群的REST调用

source: REST request to start an application
zh_cn: 启动应用的REST请求

source: REST request to take a savepoint of an application
zh_cn: 为应用生成保存点的REST请求

source: REST request to upload a JAR file
zh_cn: 上传JAR包的REST请求

source: RETAIN_ON_CANCELLATION retains the checkpoint after the application completely fails and when it is explicitly canceled.
zh_cn: RETAIN_ON_CANCELLATION在应用完全失败和显式取消时保留检查点。

source: Random
zh_cn: 随机

source: Read an Input Stream
zh_cn: 读取输入流

source: Read an input stream
zh_cn: 读取输入流

source: Read offsets of Kafka topic partitions
zh_cn: 从Kafka主题分区的读取偏移

source: Read one or more streams from data sources.
zh_cn: 从数据源中读取一条或多条流。

source: Reading from and Writing to External
zh_cn: 读写外部系统

source: Reading from and Writing to External Systems.
zh_cn: 读写外部系统

source: Real-World Streaming Use-Cases and Deployments
zh_cn: 真实的流处理用例及部署方案

source: Real-time metric plots
zh_cn: 实时绘制指标

source: Real-time recommendations (e.g., for recommending products while customers browse a retailer’s website)
zh_cn: 实时推荐（例如：在客户浏览商家页面的同时进行产品推荐）。

source: Real-time recommendations, e.g., for recommending products while customers browse on a retailer’s website,
zh_cn: 实时推荐（例如：在客户浏览商家页面的同时进行产品推荐），

source: Real-world sys‐ tems, networks, and communication channels are far from perfect, thus streaming data can often be delayed or arrive out-of-order.
zh_cn: 真实世界的系统、网络、通信信道充斥缺陷，因此流数据通常都会有所延迟或以乱序到达。

source: Real-world systems, net‐ works, and communication channels are far from perfect, and streaming data can often be delayed or arrive out of order.
zh_cn: 现实世界的系统、网络及通信信道往往充斥缺陷，因此流数据通常都会有所延迟或者以乱序到达。

source: Rebalance and rescale transformations Broadcast
zh_cn: 随机和重调转换 广播

source: Receiving Notifications About Completed Checkpoints
zh_cn: 接收检查点完成通知

source: Receiving Notifications about Completed Checkpoints
zh_cn: 接收Checkpoint完成通知

source: Reconfiguring, scaling, or updating a batch application can be done between executions, which is a lot easier than upgrading an application that is continuously ingesting, processing, and emit‐ ting data.
zh_cn: 批处理应用的配置调整、扩缩容或更新可以在它执行间隙完成；而升级一个持续接收、处理数据，并发出结果的应用则要困难很多。

source: Records can be emitted together with an associated timestamp, and watermarks can be emitted at any point in time as special records.
zh_cn: 每个发出的记录都可以附加一个时间戳，水位线可以作为特殊记录在任何时间点发出。

source: Records that are produced by a function are separately handed over to the next function with a simple method call.
zh_cn: 函数生成的记录只需通过简单的方法调用就可以分别发往各自的下游函数。

source: Records that arrive on partitions that forwarded a barrier already cannot be processed and are buf‐ fered.
zh_cn: 对于已经提供分隔符的分区，它们新到来的记录会被缓冲起来，不能处理。

source: Recovering an application from a checkpoint
zh_cn: 从检查点恢复应用

source: Recovery from a Consistent Checkpoint
zh_cn: 从一致性检查点中恢复

source: Redirecting Late Events
zh_cn: 重定向迟到事件

source: ReduceFunction and AggregateFunction are incremental aggregation
zh_cn: ReduceFunction和AggregateFunction就属于增量聚合函数。

source: ReduceFunction and AggregateFunction are incrementally applied on events that are assigned to a window.
zh_cn: ReduceFunction和AggregateFunction都是增量地应用于分配到窗口的事件。

source: ReduceFunction defines the reduce() method, which takes two input events and returns an event of the same type:
zh_cn: 它当中定义的reduce()方法每次接收两个输入事件，生成一个类型相同的输出事件：

source: ReducingState[T] offers the same methods as ListState[T] (except for addAll() and update()), but instead of appending values to a list, Reducing State.add(value: T) immediately aggregates value using a ReduceFunction.
zh_cn: ReducingState[T]提供了和ListState[T]相同的方法（除了addAll()和update()），但它的ReducingState.add(value: T)方法会立刻返回一个使用ReduceFunction聚合后的值。

source: Refer to the Flink documentation to learn about a few other corner cases when enabling exactly-once consistency.
zh_cn: 请查看Flink文档了解更多有关启用精确一次一致性时的特殊情况。

source: Refer to the documenta‐ tion for a reference of available parameters.
zh_cn: 有关它们的详细信息，请参阅文档。

source: Refer to the official documentation of Apache Flink for a complete list of supported calls.
zh_cn: 欲获取所支持的完整调用列表，请参阅Apache Flink官方文档。

source: Refer to “Filesystem Configuration” on page 237 to learn how to configure filesystems in Flink.
zh_cn: 有关如何在Flink中配置这些文件系统，请参阅第237页"文件系统配置"一节。

source: Refer to “Implementing Stateful Functions” on page 154, which discusses stateful functions in detail.
zh_cn: 有关状态化函数的详细信息请参阅第154页"实现状态化函数"一节。

source: Regardless of whether you keyBy() ConnectedStreams or you connect() two Keyed Streams, the connect() transformation will route all events from both streams with the same key to the same operator instance.
zh_cn: 无论你是对ConnectedStreams执行keyBy()还是对两个已经按键值分好区的数据流执行connect()，connect()转换都会将两个数据流中具有相同键值的事件发往同一个算子实例上。

source: Regardless of whether you run Flink in job or session mode on YARN, it needs to have access to Hadoop dependencies in the correct version and the path to the Hadoop configuration.
zh_cn: 无论是在YARN上以作业还是会话模式运行，Flink都需要访问正确版本的Hadoop依赖以及Hadoop配置所在路径。

source: Registering and using metrics
zh_cn: 注册和使用指标

source: Registering and using metrics in a FilterFunction
zh_cn: 在FilterFunction中注册和使用指标

source: Removing State from an Application
zh_cn: 从应用中删除状态

source: Removing a state from the application.
zh_cn: 从应用中移除某个状态。

source: Reporter
zh_cn: 汇报器

source: Reporters need to be configured in flink-conf.yaml.
zh_cn: 汇报器需要在flink-conf.yaml中配置。

source: Represents state as a list of entries as well.
zh_cn: 同样是将状态表示为一个条目列表，

source: Represents state as a list of entries.
zh_cn: 将状态表示为一个条目列表。

source: Reprocessing all input to reproduce lost state in the case of failures would be both very expensive and time-consuming.
zh_cn: 通过重新处理所有输入来重建故障时丢失的状态，不仅代价高，而且非常耗时。

source: Reprocessing all input to reproduce lost state in the case of fail‐ ures would be both very expensive and time-consuming.
zh_cn: 通过重新处理所有输入来重建故障期间丢失的状态，不仅代价高，而且还很耗时。

source: Request
zh_cn: 请求

source: Request GET /jobmanager/config
zh_cn: 请求 GET /jobmanager/config

source: Request GET /overview
zh_cn: 请求 GET /overview

source: Request GET /taskmanagers
zh_cn: 请求 GET /taskmanagers

source: Required Software
zh_cn: 所需软件

source: Requirements also differ when it comes to evaluating performance.
zh_cn: 而这些需求差异还体现在性能评测方面。

source: Rescale
zh_cn: 重调

source: Reset the states of all stateful tasks to the latest checkpoint.
zh_cn: 利用最新的检查点重置任务状态。

source: Resettable Source Functions
zh_cn: 可重置的数据源函数

source: Response
zh_cn: 响应

source: Response A list of all uploaded JAR files.
zh_cn: 响应 所有已上传JAR文件的列表。

source: Response Basic information about the cluster as shown above
zh_cn: 响应 上方展示的基本的集群信息

source: Response Lists the job IDs of all running applications and the job IDs of the most recently failed, canceled, and finished
zh_cn: 响应 所有正在运行应用的作业ID列表以及近期失败的、取消的和结束应用的作业ID列表。

source: Response Returns a list of all TaskManagers including their IDs and basic information, such as memory statistics and connection ports
zh_cn: 响应 返回一个涵盖所有TaskManager的列表，其中包括它们的ID以及基本信息，例如内存统计数据以及连接的端口

source: Response Returns a list of metrics that are available for the JobManager
zh_cn: 响应 返回JobManager上可获得的指标

source: Response Returns the configuration of the JobManager as defined in ./conf/flink-conf.yaml
zh_cn: 响应 返回./conf/flink-conf/yaml中定义的JobManager配置

source: Restart strategies
zh_cn: 重启策略

source: Restart strategies are discussed in more detail in Chapter 10.
zh_cn: 重启策略会在第10章详细讨论。

source: Restart strategies will be discussed in more detail in Chapter 10.
zh_cn: 重启策略会在第10章详细讨论。

source: Restart the whole application.
zh_cn: 重启整个应用。

source: Restoring the state of an application is described in a later section of this chapter.
zh_cn: 恢复应用状态将会在本章的稍后一节进行介绍。

source: Restoring the state of an application is described in “Recovery from a Con‐ sistent Checkpoint” on page 60.
zh_cn: 而恢复应用状态则会在第60页"从一致性检查点恢复"一节进行介绍。

source: Result Guarantees
zh_cn: 结果保障

source: Result guarantees
zh_cn: 结果保障

source: Resume the ingestion of all streams.
zh_cn: 恢复所有数据流的接收。

source: Resume the processing of all tasks.
zh_cn: 恢复所有任务的处理。

source: Retaining checkpoints after an application has stopped
zh_cn: 应用停止后保留检查点

source: Returns a list of metrics available for the chosen TaskManager
zh_cn: 返回指定TaskManager上可获得的指标

source: Revisiting the coffee shop example, if the shop is open from 7 a.m. to 7 p.m. and it serves 600 customers in one day, then its average throughput would be 50 customers per hour.
zh_cn: 回到刚刚咖啡店的例子，如果它的营业时间是早7点到晚7点，并且一天服务了600名顾客，那么它的平均吞吐是每小时50人。

source: Revisiting the coffee shop example, if the shop is open from 7am to 7pm and it serves 600 customers in one day, then its average throughput would be 50 customers per hour.
zh_cn: 回到刚刚咖啡店的例子，如果它的营业时间是早7点到晚7点，并且一天服务了600名顾客，那么它的平均吞吐是每小时50人。

source: Rich Functions
zh_cn: 富函数

source: Rich functions can be parameterized just like regular function classes.
zh_cn: 富函数可以像普通函数类一样接收参数。

source: Rich functions were discussed in Chapter 5.
zh_cn: 富函数已经在第5章讨论过。

source: Right after the application was restarted it is in a catch-up phase.
zh_cn: 在应用刚刚重启过后，它还处在一个追赶阶段。

source: RocksDB is an embedded key-value store that persists data to the local disk.
zh_cn: RocksDB是一个嵌入式键值存储（key-value store），它可以将数据保存到本地磁盘上。

source: RocksDB is another memory consumer that needs to be taken into consideration when configuring the memory of a worker process.
zh_cn: 我们在为工作进程配置内存时还需要考虑RocksDB的占用量。

source: RocksDB state backend with incremental checkpoints and storing the timers on the heap (default setting), they are checkpointed synchronously.
zh_cn: 如果你在使用开启了增量检查点模式RocksDB状态后端，且将计时器存储在堆内（默认设置），计时器写入检查点的过程就会是同步的。

source: RocksDBStateBackend is always writing checkpoints asynchronously:
zh_cn: RocksDBStateBackend生成检查点的过程总是异步进行的：

source: RocksDBStateBackend only requires a path to define the storage location for check‐ points and takes an optional parameter to enable incremental checkpoints (disabled by default).
zh_cn: RocksDBStateBackend只需一个用于定义检查点存储位置的路径，此外还有一个可选参数可用来启用增量检查点（默认关闭）。

source: RocksDBStateBackend stores all state into local RocksDB instances.
zh_cn: RocksDBStateBackend会把全部状态存到本地RocksDB实例中。

source: Rolling aggregation transformations are applied on a KeyedStream and produce a DataStream of aggregates, such as sum, minimum, and maximum.
zh_cn: 滚动聚合转换作用于KeyedStream上，它将生成一个包含聚合结果（例如求和、最小值、最大值等）的DataStream。

source: Rolling aggregations
zh_cn: 滚动聚合

source: Round-Robin
zh_cn: 轮流

source: Run Flink Applications in an IDE
zh_cn: 在IDE中运行Flink程序

source: Run Flink applications in an IDE
zh_cn: 在IDE中运行Flink程序

source: Run and Debug Flink Applications in an IDE
zh_cn: 在IDE中运行和调试Flink程序

source: Run and Debug Flink Applications in an IDE | 73
zh_cn: 在IDE中执行和调试Flink程序 | 73

source: Run and debug Flink applications in an IDE
zh_cn: 在IDE中执行和调试Flink程序

source: Run the command nc -l localhost 9191 on Linux
zh_cn: 你可以通过运行linux命令"nc -l localhost 9191"来监听localhost:9191端口。

source: Run the example on your local cluster by specifying the applications entry class and the JAR file.
zh_cn: 通过指定应用的入口类和JAR文件，在你的本地集群上运行示例。

source: Run the example on your local cluster by specifying the application’s entry class and JAR file:
zh_cn: 通过指定应用的入口类和JAR文件，在你本地集群上运行示例。

source: Running Flink in Docker is an easy way to set up a Flink cluster on your local machine.
zh_cn: 你可以利用Docker轻松在本地机器上搭建Flink集群。

source: Running Job-Specific Images on Minikube
zh_cn: 在Minikube上运行针对特定作业的镜像

source: Running Kubernetes on a Local Machine
zh_cn: 在本地机器上运行Kubernetes

source: Running Your First Flink Application
zh_cn: 运行首个Flink应用

source: Running a job-specific Docker image on Kubernetes
zh_cn: 在Kubernetes上运行针对特定作业的Docker镜像

source: Running a job-specific Docker image on Kubernetes is very similar to starting a Flink cluster on Kubernetes as described in “Kubernetes” on page 228.
zh_cn: 在Kubernetes上运行针对特定作业的Docker镜像和第228页"Kubernetes"中描述的在Kubernetes上启动Flink集群非常类似。

source: Running a job-specific image on a Minikube cluster requires a few more steps than those discussed in “Kubernetes” on page 228.
zh_cn: 在Minikube集群上运行针对特定作业的镜像比我们在228页"Kubernetes"一节中所讨论的步骤要复杂一些。

source: Running and Managing Streaming Applications
zh_cn: 运行并管理流式应用

source: Running and Managing Streaming Applications | 247
zh_cn: 运行并管理流式应用 | 247

source: Running and Managing Streaming Applications | 251
zh_cn: 运行并管理流式应用 | 251

source: Running and Managing Streaming Applications | 253
zh_cn: 运行并管理流式应用 | 253

source: S3 paths are specified with the s3:// scheme.
zh_cn: S3路径的协议是s3://。

source: Savepoints
zh_cn: 保存点

source: Savepoints are taken concurrently with checkpoints.
zh_cn: 保存点的生成会和检查点并发进行。

source: Savepoints can occupy a significant amount of space and are not automatically deleted by Flink.
zh_cn: 保存点可能占用大量空间，且Flink不会自动将其删除。

source: Save‐ point state can only be restored to an operator of a started application if their identifi‐ ers are identical.
zh_cn: 只有当目标应用的算子标识和保存点中的算子标识相同时，状态才能顺利恢复。

source: Scala DataStream API shortcut for a FlatMap with a keyed ValueState
zh_cn: 利用Scala DataStream API中的简写功能实现只有一个键值分区ValueState的FlatMap

source: Scala case classes
zh_cn: Scala样例类

source: Scalable stream processing technology is rapidly maturing and evolving due to the efforts of many open source communities.
zh_cn: 得益于众多开源社区的努力，可伸缩的流处理技术能够迅速发展和成熟。

source: Scaling Stateful Operators
zh_cn: 状态化算子扩缩容

source: Scaling an Application In and Out
zh_cn: 应用的扩缩容

source: Scaling an operator with keyed state out and in
zh_cn: 算子扩缩容时键值分区状态的调整

source: Scaling an operator with operator broadcast state out and in
zh_cn: 算子扩缩容时算子广播状态的调整

source: Scaling an operator with operator list state out and in
zh_cn: 算子扩缩容时算子列表状态的调整

source: Scaling an operator with operator union list state out and in
zh_cn: 算子扩缩容时算子联合列表状态的调整

source: Scaling and fault tolerance are handled by the stream processor, and by leveraging an event log as the input source the complete input of an application is reliably stored and can be deterministi‐ cally replayed.
zh_cn: 伸缩和容错交由流处理引擎完成；以事件日志作为应用的输入，不但完整可靠，而且还支持精准的数据重放。

source: Scaling and fault-tolerance do not need special consideration because these aspects are handled by the stream processor.
zh_cn: 无须考虑伸缩性和容错性。这些都交给流处理引擎处理。

source: Scheduling tasks as slices to slots has the advantage that many tasks are co-located on the TaskManager which means that they can efficiently exchange data within the the same process and without accessing the network.
zh_cn: 将任务以切片的形式调度至处理槽中有一个好处：TaskManager中的多个任务可以在同一进程内高效地执行数据交换而无须访问网络。

source: Scheduling tasks as slices to slots has the advantage that many tasks are colocated on the TaskManager, which means they can efficiently exchange data within the the same process and without accessing the network.
zh_cn: 将任务以切片的形式调度至处理槽中有一个好处：TaskManager中的多个任务可以在同一进程内高效地执行数据交换而无须访问网络。

source: Scope
zh_cn: 域

source: Scope Identifiers per Job Must Be Unique
zh_cn: 每个作业的域标识必须唯一

source: Scoping and formatting metrics
zh_cn: 域和格式指标

source: Screenshot of Apache Flink’s web dashboard showing a running job
zh_cn: 展示运行作业的Apache Flink Web UI截图

source: Screenshot of Apache Flink’s web dashboard showing a running job.
zh_cn: 展示运行作业的Apache Flink Web仪表盘截图

source: Screenshot of Apache Flink’s web dashboard showing the overview
zh_cn: Apache Flink Web UI概览页面截图

source: Screenshot of Apache Flink’s web dashboard showing the overview.
zh_cn: 展示概览的Apache Flink Web仪表盘截图

source: Search for the AverageSensorReadings class and open it.
zh_cn: 找到AverageSensorReadings类，打开它。

source: Second, a checkpoint may be delayed because we need to wait for another checkpoint to complete results in a lower check‐ pointing interval, leading to longer catch-up processing during recovery.
zh_cn: 其次，检查点生成会被推迟，因为等待当前正在进行的检查点完成会导致更高的生成间隔，继而导致在恢复时需要更长时间去处理数据和追赶进度。

source: Second, it matches for each operator the state identifiers (see “Savepoints” for details) of the savepoint and the application.
zh_cn: 其次，它会针对每个算子比较保存点和应用内的状态标识符（详细信息请参阅"保存点"一节）。

source: Second, the latest results computed by the stream processor are not accurate but only approximated.
zh_cn: 其次，流处理引擎计算的最新结果仅仅是不精确的近似结果；

source: Second, the results compu‐ ted by the stream processor are only approximate.
zh_cn: 其次，流处理引擎计算的结果只是近似的；

source: Second, you can have tasks from different operators performing computations on the same or different data in parallel.
zh_cn: 再者，你可以让不同算子的任务（基于相同或不同的数据）并行计算，

source: Security
zh_cn: 安全性

source: See Chapter 3 for details on how operator list union state is distributed.
zh_cn: 有关算子列表状态在实例上进行分配的详情请参阅第3章。

source: See Chapter 3 to learn about savepoints and what you can do with them.
zh_cn: 有关保存点及其用途请参阅第3章。

source: See Chapter 5 for details on the RichFunction interface.
zh_cn: 有关该抽象类的详细信息，请参阅第5章。

source: See Chapter 6 for details about the timestamp assigner interfaces.
zh_cn: 有关时间戳分配接口的详细信息请参照第6章。

source: See Chapter 8 for details on keyed state.
zh_cn: 有关键值分区状态的详细信息请参阅第8章。

source: See details in “Apache Kafka Sink Connector”.
zh_cn: 详情参见"Apache Kafka Sink Connector"一节。

source: See the documentation to learn more about the available set‐
zh_cn: 有关这些设置的具体信息，请参阅文档。

source: See “Checkpointing and State Backends” on page 243 for a description
zh_cn: （有关可用的配置项，请参见第243页"检查点和状态后端"一节）：

source: See “Configuring Recovery” for details on this feature.
zh_cn: 有关该功能的详细信息，请参阅"配置故障恢复"。

source: See “Scaling Stateful Operators” on page 56 for details on how the different types of operator state and keyed state are scaled.
zh_cn: 有关不同类型的算子状态和键值分区状态是如何伸缩的，请参见第56页"状态化算子扩缩容"一节。

source: See “Scaling Stateful Operators” on page 56 for details on the distribution behavior of operator list state and union list state.
zh_cn: 有关算子列表状态或联合列表状态的分配行为细节，请参照第56页"状态化算子的扩缩容"。

source: Select the Maven project to import
zh_cn: 选择要导入的Maven项目

source: Selecting metrics to plot
zh_cn: 选择需要绘制的指标

source: Semantic.AT_LEAST_ONCE, which guarantees that no write is lost but might be duplicated.
zh_cn: Semantic.AT_LEAST_ONCE，保证数据不会丢失，但可能会重复写入。

source: Semantic.EXACTLY_ONCE, which builds on Kafka’s transactions to write each record exactly once.
zh_cn: Semantic.EXACTLY_ONCE，基于Kafka的事务机制，保证记录可以精确一次写入。

source: Semantic.NONE, which provides no guarantees—records might be lost or written multiple times.
zh_cn: Semantic.NONE，不做任何一致性保障，记录可能会丢失或写入多次。

source: Sending a request that blocks the asyncInvoke() method
zh_cn: 发送导致asyncInvoke()方法阻塞的请求

source: Sending an asynchronous request but waiting inside the asyncInvoke() method for the request to complete
zh_cn: 发送异步请求，但在asyncInvoke()方法内等待请求完成

source: Sending individual records over a network connection is inefficient and causes signif‐ icant overhead.
zh_cn: 通过网络连接逐条发送记录不但低效，还会导致很多额外开销。

source: SensorReading contains the sensor ID, a timestamp denoting when the measurement was taken, and the measured temperature.
zh_cn: 每一条SensorReading数据都包括传感器ID，表示测试时间的时间戳以及测量的温度。

source: SerializationSchema is the counterpart of the DeserializationSchema that we dis‐ cussed in the Kafka source section.
zh_cn: SerializationSchema和我们在Kafka数据源一节讨论的DeserializationSchema作用相反。

source: Session windows are useful in a common real-world scenario where neither tumbling nor sliding windows can be applied.
zh_cn: 会话窗口在一类常见的真实场景下非常有用，该场景中既不适合用滚动窗口也不适合用滑动窗口。

source: Session window
zh_cn: 会话窗口

source: Session window.
zh_cn: 会话窗口。

source: Session windows
zh_cn: 会话窗口

source: Session windows are useful in common real-world scenarios where neither tum‐ bling nor sliding windows can be applied.
zh_cn: 会话窗口（session window）在一些常见的真实场景中非常有用，这些场景既不适合用滚动窗口也不适合用滑动窗口。

source: Session windows group events in session based on a session gap value that defines the time of inactivity to consider a session closed.
zh_cn: 会话窗口根据会话间隔（session gap）将事件分为不同的会话，该间隔值定义了会话在关闭前的非活动时间长度。

source: Session windows group events in sessions based on a session gap value that defines the time of inactivity to consider a session closed.
zh_cn: 会话窗口根据会话间隔（session gap）将事件分为不同的会话，该间隔值定义了会话在关闭前的非活动时间长度。

source: Sessions are com‐ prised of a series of events happening in adjacent times followed by a period of inactivity.
zh_cn: 会话由发生在相邻时间内的一系列事件外加一段非活动时间组成。

source: Sessions com‐ prise of a series of events happening in adjacent times followed by a period of inactivity.
zh_cn: 会话由发生在相邻时间内的一系列事件外加一段非活动时间组成。

source: Set Up the Execution Environment
zh_cn: 设置执行环境

source: Set up the Execution Environment
zh_cn: 设置运行环境

source: Set up the execution environment.
zh_cn: 设置执行环境。

source: Setting Flink Up for Streaming Applications.
zh_cn: 配置Flink运行流式应用

source: Setting Up Flink for Streaming Applications
zh_cn: 搭建Flink运行流式应用

source: Setting Up Flink for Streaming Applications.
zh_cn: 搭建Flink运行流式应用

source: Setting Up a Development Environment for
zh_cn: 设置Apache Flink开发环境
